---
kind: property
id: P:Autodesk.Revit.DB.Analysis.HVACLoadType.HeatingSetPoint
source: html/f50580b5-f523-258c-a468-f8e882c3e75d.htm
---
# Autodesk.Revit.DB.Analysis.HVACLoadType.HeatingSetPoint Property

The heating temperature set point in unit Kelvin (K).

## Syntax (C#)
```csharp
public double HeatingSetPoint { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: